class_name script_text

# 立绘显示，立绘图片索引，文本
static var stext = {
	# 张衡
	"s1":[
		[["left"],["张衡-我","张衡"],"这...这是哪里？","我"],
		[["right"],["",""],"此间为灵台观星之所。","张衡"],
		[["left"],["",""],"你是？","我"],
		[["right"],["",""],"老夫南阳张衡，字平子。","张衡"],
		[["left"],["",""],"竟是造候风地动仪的张公！","我"],
		[["right"],["",""],"浑天四游之仪散佚四方，小友可愿助老夫寻回？","张衡"],
		[["left"],["",""],"谨遵先生吩咐，晚辈这便去寻。","我"],
		[["right"],["",""],"且慢行！老夫适才观天象，见紫微垣下有异物隐现......","张衡"],
		[["right"],["",""],"当在灵台残碑之后，其物隐泛铜青之色。","张衡"]
	],
	"s1 find one":[
		[["right"],["张衡-我","张衡"],"这么快就找到了！赶快下一个吧！","张衡"]
	],
	"s1 find tow":[
		[["right"],["张衡-我","张衡"],"既得璇玑玉衡，可愿共参天体运行之妙？","张衡"]
	],
	"s1 repair begin":[
		[["right"],["张衡-我","张衡"],"浑仪诸环，独赤道、地平二圈需正。请小友以星斗为引，重定天地之衡。","张衡"]
	],
	"s1 repair end":[
		[["right"],["张衡-我","张衡"],"妙哉！赤道地平，各复其位，此仪可再测二十八宿距度矣。","张衡"],
		[["right"],["张衡-我","张衡"],"小友可知？此间星辰轨迹，与你来时之世... ","张衡"]
	],

	# 沈括
	"s2":[
		[["right"],["沈括-我","沈括"],"醒神！","沈括"],
		[["left"],["",""],"失礼了！方才竟未识得沈先生真容...","我"],
		[["right"],["",""],"前日既明“燧金取火“之理，今当验之。","沈括"],
		[["right"],["",""],"凹者聚光为燧，凸者散光成霞。二者孰宜？","沈括"],
		[[""],["",""],"【选择你要使用的镜子吧！左：凹透镜；右：凸透镜】",""]
	],
	"s2 choose false":[
		[["right"],["沈括-我","沈括"],"且观镜中天象——月蚀时地影如弧，岂非凹镜聚光之证？","沈括"],
	],
	"s2 damo begin":[
		[["right"],["沈括-我","沈括"],"此镜经年蒙尘，需先治其昏翳。","沈括"],
		[["right"],["",""],"顺其晶纹，如抚焦桐。凡七往复，则鉴若止水。","沈括"]
	],
	"s2 damo end":[
		[["right"],["沈括-我","沈括"],"很好，你完成了打磨！","沈括"]
	],
	"s2 fire begin":[
		[["right"],["沈括-我","沈括"],"现在就只剩等待了。","沈括"]
	],
	"s2 fire mid":[
		[["left"],["沈括-我","沈括"],"先生你看，已经有火星了！","我"] # 此处pass
	],
	"s2 fire end":[
		[["left"],["沈括-我","沈括"],"先生！阳燧生焰，恰合《笔谈》“光聚如黍“之载！","我"],
		[["right"],["",""],"善！此火虽微，可证”格物致知”非虚言也。","沈括"],
		[["right"],["",""],"他日若见”雷射之火”，莫忘此镜初心...","沈括"]
	],
	"s2 change mirror":[
		[["right"],["沈括-我","沈括"],"且转动此镜，使日光聚为一点，落于干草之上。","沈括"],
		[["left"],["",""],"谨受教，弟子当效先生格物之法。","我"]
	],

	# 宋应星
	"s3 begin":[
		[["right"],["宋应星-我","宋应星"],"小友可算到了。","宋应星"],
		[["right"],["",""],"令堂曾言你于格物之道颇有天分，今日便传你这火药相配之理。","宋应星"],
		[["left"],["",""],"但凭先生指点。","我"],
		[["right"],["",""],"《武备志》云：“硝为君，磺为臣，炭为佐使。","宋应星"],
		[[""],["",""],"移动原料瓶倒入石臼，从左到右：硝石、硫磺、木炭。",""]
	],
	's3 after use b':[
		[["right"],["宋应星-我","宋应星"],"研磨如抚琴。","宋应星"],
	],
	's3 re ope':[
		[["right"],["宋应星-我","宋应星"],"咳咳...且住！你听这滞涩之声，怕是重蹈了万历年间王恭厂之祸...","宋应星"],
		[["right"],["",""],"无妨！景德镇的窑工常说——十窑九不成，可那一成便是传世珍品。","宋应星"]
	],
	's3 true':[
		[["right"],["宋应星-我","宋应星"],"这沙沙声！当年毕懋康造自生火铳时，便是这般韵律。","宋应星"],
		[["left"],["",""],"这“飞空击贼震天雷”的配方，该当传于后世。","我"]
	]
}

# 当次文本
static var this_talk_name : String = ''
# 判定一段话是否说完了
static var is_talk_end : bool = false # 默认说完了,每次开始说的时候会进行修改

# 一些场景跳转的显示
# 张衡 -> 相关物品框
static var diping : bool = false
static var chidao : bool = false
static var zhangheng_tscn : Node2D
static var zhangheng_re_bool : bool = false

# 沈括
static var fire_m : Node2D

# 宋应星
