class_name script_text

# 立绘显示，立绘图片索引，文本
static var stext = {
	# 张衡begin
	"s1":[
		[["left"],["张衡-我","张衡"],"我:这...这是哪里？"],
		[["right"],["",""],"张衡:这里是我的天文台。"],
		[["left"],["",""],"我:你是？"],
		[["right"],["",""],"张衡:老夫乃张衡。"],
		[["right"],["",""],"张衡:小子，能否帮老夫找回散落的浑天仪部件。"],
		[["left"],["",""],"我:（原来是张衡，我果然穿越了）没问题，先生。"],
		[["right"],["",""],"张衡:我好像看到草坪、天文台后面有东西，你先去看看..."],
		[["left"],["",""],"我:好..."]
	],
	"s1 find one":[
		[["right"],["张衡-我","张衡"],"张衡:这么快就找到了！赶快下一个吧！"]
	],
	"s1 find tow":[
		[["right"],["张衡-我","张衡"],"张衡:谢谢你小伙子，帮我找回了浑仪部件，看你学富五车，能否帮老夫复原此仪器？"],
		[["left"],["",""],"我:没问题，包在我身上。"]
	],
	"s1 repair begin":[
		[["right"],["张衡-我","张衡"],"张衡:移动部件，复原浑天仪！"]
	],
	"s1 repair end":[
		[["right"],["张衡-我","张衡"],"张衡:小子，谢谢你帮我复原了浑天仪！"]
	],
	
	"s2":[
		[["right"],["沈括-我","沈括"],"沈括：醒醒,别睡了..."],
		[["left"],["",""],"我：(我刚刚碰到的那本书是《梦溪笔谈》，他是...沈括)不好意思，先生。"],
		[["right"],["",""],"沈括：好了，现在继续你的实验吧。"],
		[["left"],["",""],"我：实验？"],
		[["right"],["",""],"沈括：上次我讲了镜子点火原理，今天是我们约定的进行实验的日子，开始吧。"],
		[["left"],["",""],"我：我想起来了！"],
		[[""],["",""],"【选择你要使用的镜子吧！左：凹透镜；右：凸透镜】"]
	],
	"s2 choose false":[
		[["right"],["沈括-我","沈括"],"沈：再仔细想想。(凸透镜反射的光是发散的，凹透镜反射的光会聚集一点)"],
		[["left"],["",""],"我：我明白了！"]
	],
	"s2 damo begin":[
		[["right"],["沈括-我","沈括"],"沈括：就是这面镜子，接下来使用青石磨棒将镜面打磨光滑吧！"]
	],
	"s2 damo end":[
		[["right"],["沈括-我","沈括"],"沈括：很好，你完成了打磨！"]
	],
	"s2 fire begin":[
		[["right"],["沈括-我","沈括"],"沈括：现在就只剩等待了。"]
	],
	"s2 fire mid":[
		[["left"],["沈括-我","沈括"],"我：先生你看，已经有火星了！"]
	],
	"s2 fire end":[
		[["left"],["沈括-我","沈括"],"我：成功了，成功了！先生你看..."]
	],
	"s2 change mirror":[
		[["right"],["沈括-我","沈括"],"沈括：现在转动镜面，让光聚在干草上吧！"]
	]
}

# 当次文本
static var this_talk_name : String = ""
# 判定一段话是否说完了
static var is_talk_end : bool = false # 默认说完了,每次开始说的时候会进行修改

# 一些场景跳转的显示
# 张衡 -> 相关物品框
static var diping : bool = false
static var chidao : bool = false

static var zhangheng_tscn : Node2D
static var zhangheng_re_bool : bool = false

static var fire_m : Node2D
